package com.example.task5_1;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class MainActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        RecyclerView recyclerView = findViewById(R.id.recyclerView);

        ArrayList<Recipe> recipes = new ArrayList<>();

        recipes.add(new Recipe (1, "Γέμιση πιροσκί με πατάτα και μπέικον ", "Με αυτή τη γέμιση τα πιροσκί σας θα γίνουν ανάρπαστα! Προσθέτοντας πατάτα και μπέικον θα πάρουν μια μοναδική γεύση που σίγουρα δεν θα μείνετε στο ένα!Υλικά συνταγής\n" +
                "\n" +
                "    Μισό κιλό πατάτες\n" +
                "    150 γρ. μπέικον, κομμένο σε κύβους\n" +
                "    2 κ.σ. βούτυρο\n" +
                "    Πιπέρι\n" +
                "\n" +
                "Εκτέλεση συνταγής\n" +
                "\n" +
                "Αρχικά, βράζουμε τις πατάτες, τις καθαρίζουμε και τις κόβουμε σε μικρά κυβάκια.\n" +
                "\n" +
                "Στη συνέχεια, σε ένα τηγάνι λιώνουμε το βούτυρο και σοτάρουμε καλά το μπέικον.\n" +
                "\n" +
                "Κατόπιν, προσθέτουμε τις πατάτες, τις σοτάρουμε μαζί με τα υπόλοιπα υλικά, ρίχνουμε το πιπέρι και τέλος τις αφήνουμε να κρυώσουν.\n" +
                "\n" +
                "Γεμίζουμε με το μείγμα αυτό τα πιροσκί.\n" +
                "\n" +
                "Καλή επιτυχία!\n" +
                "Συμβουλές\n" +
                "\n" +
                "    Αν θέλουμε καυτερή γεύση μπορούμε να προσθέσουμε λίγη σκόνη σκόρδου στη γέμιση μας.\n"));
        recipes.add(new Recipe (2,"Μεθυσμένο κοτόπουλο, όνειρο!","Αν ψάχνετε μια συνταγή για το κυρίως πιάτο του τραπεζιού σας έχουμε τη λύση. Μεθυσμένο κοτόπουλο, όνειρο! Υπόσχεται νοστιμιά και απόλαυση. Δοκιμάστε το και θα μείνετε ευχαριστημένοι!Υλικά συνταγής\n" +
                "\n" +
                "    1 κοτόπουλο περίπου (1 μισή κιλό), κομμένο σε μερίδες\n" +
                "    45 γρ. βούτυρο\n" +
                "    125 γρ. μπέικον, κομμένο σε κυβάκια\n" +
                "    2 κρεμμύδια ,τριμμένα\n" +
                "    4 κ.σ. ουίσκι\n" +
                "    Μισό λίτ. κόκκινο κρασί, ξηρό\n" +
                "    2 σκ. σκόρδο, πολτοποιημένες\n" +
                "    250 γρ. μικρά μανιτάρια, ολόκληρα\n" +
                "    1 ματσ. αρωματικά χόρτα (δεντρολίβανο, θυμάρι, σέλινο)\n" +
                "    1 κ.σ. αλεύρι\n" +
                "    Αλάτι\n" +
                "    Πιπέρι, φρεσκοτριμμένο\n" +
                "\n" +
                "Εκτέλεση συνταγής\n" +
                "\n" +
                "Αρχικά, διαλύουμε 2 κουταλιές της σούπας βούτυρο σε μια κατσαρόλα.\n" +
                "\n" +
                "Ρίχνουμε το κρεμμύδι και το μπέικον και τα σοτάρουμε ελαφρά για λίγα λεπτά.\n" +
                "\n" +
                "Τα βγάζουμε από την κατσαρόλα και τα φυλάμε.\n" +
                "\n" +
                "Στη συνέχεια, βάζουμε το κοτόπουλο στην κατσαρόλα, το περιχύνουμε με το ουίσκι και το ανάβουμε.  \n" +
                "\n" +
                "Όταν σβήσει η φλόγα ρίχνουμε το κρεμμύδι, το μπέικον και το ματσάκι με τα μυρωδικά.\n" +
                "\n" +
                "Ζεσταίνουμε το κρασί σε ένα κατσαρολάκι και το ρίχνουμε στο κοτόπουλο.\n" +
                "\n" +
                "Έπειτα, προσθέτουμε το σκόρδο και το αλατοπίπερο.\n" +
                "\n" +
                "Ψήνουμε το φαγητό σκεπασμένο για 1 ώρα.\n" +
                "\n" +
                "Κατόπιν, ρίχνουμε και τα μανιτάρια και συνεχίζουμε το βράσιμο για 15 λεπτά επιπλέον.\n" +
                "\n" +
                "Διαλύουμε καλά το αλεύρι στο υπόλοιπο βούτυρο (1 κουταλάκι).\n" +
                "\n" +
                "Αφαιρούμε από την κατσαρόλα το ματσάκι των μυρωδικών και ρίχνουμε το βούτυρο με το αλεύρι που ετοιμάσαμε.\n" +
                "\n" +
                "Τέλος, το αναμειγνύουμε καλά για να πήξει και να βράσει για λίγα λεπτά μαζί με το αλεύρι.\n" +
                "\n" +
                "Το κοτόπουλο μας είναι έτοιμο.\n" +
                "\n" +
                "Καλή επιτυχία και καλή όρεξη!"));
        recipes.add(new Recipe (3,"Διαφορετικό χοιρινό με αμύγδαλα ","Ένα πιάτο ιδανικό για ένα επίσημο τραπέζι και όχι μόνο. Διαφορετικό χοι-ρινό με αμύγδαλα. Υπέροχοι συνδυασμοί και γεύσεις που δένουν μοναδικά μεταξύ τους. Δοκιμάστε το!Υλικά συνταγής \n" +
                "\n" +
                "    600 γρ. κρέας χοιρινό, κομμένο σε μπουκιές\n" +
                "    4 ασπράδια αυγών\n" +
                "    Μισό κ.τσ. αλάτι\n" +
                "    1 κ.σ. αλεύρι\n" +
                "    5 κ.σ. κορν φλάουρ (3+2)\n" +
                "    8 κ.σ. νερό\n" +
                "    3 κ.σ. άσπρο ξηρό κρασί\n" +
                "    2 κ.σ. σόγια σος\n" +
                "    2 κρεμμυδάκια φρέσκα, ψιλοκομμένα\n" +
                "    Μισό κ.τσ. τζίντζερ σκόνη\n" +
                "    Μισό κ.τσ. σκόρδο σκόνη\n" +
                "    1 κ.τσ. ζάχαρη\n" +
                "    8 κ.σ. σησαμέλαιο (4+4)\n" +
                "    1 πράσινη πιπεριά, κομμένη σε καρεδάκια\n" +
                "    Μισό κ.τσ. πιπέρι καγιέν\n" +
                "    Μισό φλ.τσ. αμύγδαλα, βρασμένα και ξεφλουδισμένα\n" +
                "\n" +
                "Εκτέλεση συνταγής\n" +
                "\n" +
                "Αρχικά, πλένουμε και στεγνώνουμε το χοιρινό.\n" +
                "\n" +
                "Χτυπάμε τα ασπράδια των αυγών με το αλάτι.\n" +
                "\n" +
                "Προσθέτουμε 3 κουταλιές της σούπας κορν φλάουρ και 1 κουταλιά της σούπας αλεύρι.\n" +
                "\n" +
                "Στη συνέχεια, βάζουμε τα κομματάκια του χοιρινού μέσα στα χτυπημένα αυγά και τα αφήνουμε όσο ετοιμάζουμε τα υπόλοιπα υλικά.\n" +
                "\n" +
                "Αναμειγνύουμε σε ένα μπολ το νερό, 2 κουταλιές της σούπας κορν φλάουρ, το κρασί, τη σόγια σος, τα κρεμμυδάκια, το τζίντζερ, το σκόρδο, τη ζάχαρη και κρατάμε το μείγμα.\n" +
                "\n" +
                "Έπειτα, ζεσταίνουμε στο γουόκ 2 κουταλιές της σούπας σησαμέλαιο.\n" +
                "\n" +
                "Βγάζουμε λίγα λίγα τα κομματάκια του χοιρινού από το μείγμα των αυγών.\n" +
                "\n" +
                "Τα στραγγίζουμε και τα ρίχνουμε στο καυτό σησαμέλαιο.\n" +
                "\n" +
                "Κατόπιν, τα τηγανίζουμε απ’ όλες τις πλευρές για 5 με 6 λεπτά και όταν βεβαιωθούμε ότι έχουν κάνει κρούστα, τα βγάζουμε από το ελαιόλαδο και τα κρατάμε πάνω σε χαρτί κουζίνας.\n" +
                "\n" +
                "Βγάζουμε το ελαιόλαδο από το γουόκ.\n" +
                "\n" +
                "Το σκουπίζουμε με χαρτί κουζίνας και προσθέτουμε το υπόλοιπο σησαμέλαιο (4 κουταλιές της σούπας).\n" +
                "\n" +
                "Αναμειγνύουμε το υπόλοιπο σησαμέλαιο (4 κουταλιές της σούπας) με το πιπέρι καγιέν και το ρίχνουμε στο γουόκ.\n" +
                "\n" +
                "Μετά, ρίχνουμε τις πιπεριές και τις γυρίζουμε για 2 με 3 λεπτά.\n" +
                "\n" +
                "Προσθέτουμε τα κομματάκια του χοιρινού και τα αμύγδαλα.\n" +
                "\n" +
                "Χτυπάμε πάλι το μείγμα των υλικών που έχουμε κρατήσει και το ρίχνουμε στο γουόκ.\n" +
                "\n" +
                "Χαμηλώνουμε τη φωτιά, σκεπάζουμε το γουόκ και αφήνουμε το φαγητό να πάρει μια βράση για να αναμειχθούν τα υλικά και να πήξει η σάλτσα.\n" +
                "\n" +
                "Τέλος, το σερβίρουμε ζεστό από το γουόκ.\n" +
                "\n" +
                "Καλή όρεξη!\n" +
                "Συμβουλές\n" +
                "\n" +
                "    Μπορούμε να αντικαταστήσουμε το σησαμέλαιο με κάποιο άλλο ελαιόλαδο (π.χ. σπορέλαιο)\n"));
        recipes.add(new Recipe (4,"Απολαυστικές πένες με τυρί κρέμα ","Αυτή η συνταγή σίγουρα θα γίνει ανάρπαστη. Οι απολαυστικές πένες με τυρί κρέμα θα ικανοποιήσουν σίγουρα και τον πιο απαιτητικό. Νοστιμιά σε κάθε μπουκιά. Δοκιμάστε τες!Υλικά συνταγής\n" +
                "\n" +
                "    200 γρ. τυρί ρικότα\n" +
                "    120 γρ. κρέμα γάλακτος\n" +
                "    4 κ.σ. βούτυρο\n" +
                "    200 γρ. παρμεζάνα, τριμμένη\n" +
                "    650 γρ. μακαρόνια πένες\n" +
                "    Μοσχοκάρυδο\n" +
                "    4 κρόκους αυγού\n" +
                "    Αλάτι\n" +
                "    Πιπέρι μαύρο, φρεσκοτριμμένο\n" +
                "\n" +
                "Εκτέλεση συνταγής\n" +
                "\n" +
                "Αρχικά, ετοιμάζουμε τις πένες σύμφωνα με τις οδηγίες στο πακέτο και τις στραγγίζουμε καλά μόλις ετοιμαστούν.\n" +
                "\n" +
                "Εν τω μεταξύ, αναμειγνύουμε τους κρόκους, την τριμμένη παρμεζάνα και τη ρικότα σε ένα μπολ.\n" +
                "\n" +
                "Προσθέτουμε την κρέμα και ανακατεύουμε με ένα πιρούνι.\n" +
                "\n" +
                "Στη συνέχεια, τρίβουμε λίγο μοσχοκάρυδο και προσθέτουμε αλάτι και πιπέρι.\n" +
                "\n" +
                "Βάζουμε την άδεια κατσαρόλα σε μέτρια φωτιά, λιώνουμε το βούτυρο, προσθέτουμε τις στραγγισμένες πένες και ανακατεύουμε καλά.\n" +
                "\n" +
                "Σβήνουμε το μάτι και κατόπιν ρίχνουμε το μείγμα με τη ρικότα.\n" +
                "\n" +
                "Ανακατεύουμε καλά με ένα μεγάλο κουτάλι μέχρι η σως να καλύψει τις πένες.\n" +
                "\n" +
                "Τέλος, αφήνουμε για περίπου 2 λεπτά σε μέτρια φωτιά μέχρι να δέσει και σερβίρουμε αμέσως σε ζεστά ατομικά μπολ.\n" +
                "\n" +
                "Οι πένες με τυρί κρέμα είναι έτοιμες.\n" +
                "\n" +
                "Καλή επιτυχία και καλή όρεξη!\n" +
                "Συμβουλές\n" +
                "\n" +
                "    Αν θέλουμε να απογειώσουμε το πιάτο, προσθέτουμε στη συνταγή κοτόπουλο στήθος, σε λεπτές φέτες.\n"));
        recipes.add(new Recipe (5,"Νόστιμο μοσχάρι εξοχής με βότανα και κρασί ","Με αυτή τη συνταγή θα γλύφετε τα δάχτυλα σας. Δοκιμάστε οπωσδήποτε το πεντανόστιμο μοσχάρι εξοχής με βότανα και κρασί. Τρυφερό και γευστικότατο. Συνοδεύεται τέλεια με ρύζι ή πατάτες.Υλικά συνταγής\n" +
                "\n" +
                "    Μισό κιλό κιλότο, μοσχαρίσιο\n" +
                "    3 κ.σ. ελαιόλαδο\n" +
                "    1 κρεμμύδι, ψιλοκομμένο\n" +
                "    1 καρότο ψιλοκομμένο σε κυβάκια ή τριμμένο\n" +
                "    1 κλωνάρι σέλερι, ψιλοκομμένο σε καρεδάκια\n" +
                "    2 φλ. μανιτάρια, καθαρισμένα και ψιλοκομμένα\n" +
                "    1 δαφνόφυλλο\n" +
                "    1 κ.σ. πελτέ ντομάτας\n" +
                "    2 μισή φλ. κόκκινο κρασί, ξηρό\n" +
                "    2 φλ. ζωμό κρέατος\n" +
                "    2 ντομάτες\n" +
                "\n" +
                "Για το μείγμα βοτάνων\n" +
                "\n" +
                "    3 σκ. σκόρδο, πολτοποιημένες\n" +
                "    Μισό φλ. μαϊντανό, ψιλοκομμένο\n" +
                "    4 φρέσκα φύλλα φασκόμηλο, ψιλοκομμένα\n" +
                "    1 κ.γλ. δεντρολίβανο\n" +
                "    1 κ.σ. ελαιόλαδο\n" +
                "    Πιπέρι, φρεσκοτριμμένο  \n" +
                "\n" +
                "Εκτέλεση συνταγής\n" +
                "\n" +
                "Αρχικά σε ένα μπολ φτιάχνουμε το μείγμα βοτάνων ενώνοντας όλα τα υλικά.\n" +
                "\n" +
                "Θα χρησιμοποιήσουμε το μισό μείγμα στο κρέας και το υπόλοιπο στο τελείωμα της συνταγής.\n" +
                "\n" +
                "Με μυτερό και μακρύ μαχαίρι κάνουμε 10 βαθιές χάρακές στο κρέας και τις γεμίζουμε με λίγο μείγμα βοτάνων, μπήγοντας το με το δάχτυλό μας.\n" +
                "\n" +
                "Σε μέτρια προς δυνατή φωτιά και σε μικρή κατσαρόλα ζεσταίνουμε το ελαιόλαδο και ροδίζουμε από όλες τις πλευρές το κρέας μέχρι να κάνει κρούστα, περίπου 5 λεπτά για κάθε πλευρά.\n" +
                "\n" +
                "Στη συνέχεια όταν ροδίσει, το βγάζουμε σε πιατέλα, το αλατίζουμε και το σκεπάζουμε να διατηρηθεί ζεστό.\n" +
                "\n" +
                "Από την κατσαρόλα αφαιρούμε με κουτάλι το περισσότερο λίπος και κρατάμε 2 κουταλιές της σούπας.\n" +
                "\n" +
                "Σε αυτό σοτάρουμε το κρεμμύδι, το καρότο, το σέλερι, τα μανιτάρια και το δεντρολίβανο.\n" +
                "\n" +
                "Αφήνουμε να γυαλίσουν ελαφρά περίπου 5 λεπτά, προσθέτουμε το υπόλοιπο μείγμα βοτάνων και τον πελτέ ντομάτας.\n" +
                "\n" +
                "Κατόπιν, σβήνουμε με μισό φλιτζάνι κρασί και αφήνουμε να εξατμιστεί σχεδόν όλο το υγρό.\n" +
                "\n" +
                "Έτσι συμπυκνώνουμε και κρατάμε όλα τα αρώματα κρασιού, λαχανικών και βοτάνων.\n" +
                "\n" +
                "Στη συνέχεια προσθέτουμε ένα φλιτζάνι κρασί και 1 φλιτζάνι ζωμό.\n" +
                "\n" +
                "Κόβουμε στα δυο τις ντομάτες, τις σφίγγουμε να φύγουν υγρά και σπόροι και τις βάζουμε στην κατσαρόλα.\n" +
                "\n" +
                "Μόλις πάρει βράση, σκεπάζουμε και χαμηλώνουμε τη φωτιά.\n" +
                "\n" +
                "Αλατοπιπερώνουμε, αν χρειάζεται.\n" +
                "\n" +
                "Σιγοβράζουμε περίπου για 2 ώρες, γυρίζοντας το κιλότο κάθε μισή ώρα για να μη στεγνώσει.\n" +
                "\n" +
                "Τέλος, κόβουμε σε φέτες το κρέας σε πιατέλα και περιχύνουμε με τη σάλτσα.\n" +
                "\n" +
                "Καλή όρεξη!\n" +
                "Συμβουλές\n" +
                "\n" +
                "    Aν η σάλτσα μας φαίνεται αραιή, τη βράζουμε για λίγα λεπτά να πυκνώσει.\n" +
                "    Αντί για φρέσκα φύλλα φασκόμηλο μπορούμε να χρησιμοποιήσουμε 1 κουταλιά της σούπας αποξηραμένο.\n"));
        recipes.add(new Recipe (6, "Νόστιμο ψαρονέφρι με μήλα και βαλσάμικο ξύδι " , "Η συνταγή που υπόσχεται νοστιμιά και απόλαυση. Ψαρονέφρι με μήλα και βαλσάμικο ξύδι. Υπέροχοι συνδυασμοί σε ένα εξαιρετικό πιάτο με εντυπωσιακή εμφάνιση!Υλικά συνταγής\n" +
                "\n" +
                "    600 γρ. ψαρονέφρι\n" +
                "    2 μήλα\n" +
                "    150 γρ. ελαιόλαδο\n" +
                "    1 φλ. πυκνός ζωμός κρέατος\n" +
                "    50 γρ. ξύδι βαλσάμικο\n" +
                "\n" +
                "Εκτέλεση συνταγής\n" +
                "\n" +
                "Αρχικά, κόβουμε το ένα μήλο σε λεπτές φέτες και το άλλο σε χοντρά καρέ.\n" +
                "\n" +
                "Σοτάρουμε σε βαρύ τηγάνι το ψαρονέφρι, κομμένο σε «μενταγιόν».\n" +
                "\n" +
                "Όταν το κρέας είναι μέτρια ψημένο, προσθέτουμε τα μήλα στο τηγάνι και τα αφήνουμε να σοταριστούν.\n" +
                "Έπειτα, σβήνουμε με το βαλσάμικο ξίδι.\n" +
                "\n" +
                "Κατόπιν, προσθέτουμε και το ζωμό κρέατος και αφήνουμε να βράσει για 2 λεπτά.\n" +
                "\n" +
                "Τέλος σερβίρουμε το ψαρονέφρι, τοποθετώντας, στο κέντρο του πιάτου το καρέ μήλου και γύρω γύρω το μενταγιόν.\n" +
                "\n" +
                "Καλή επιτυχία και καλή όρεξη!\n" +
                "Συμβουλές\n" +
                "\n" +
                "    Γαρνίρουμε το ψαρονέφρι με φέτες μήλου.\n"));

        LinearLayoutManager layoutManager = new LinearLayoutManager(this);
        recyclerView.setLayoutManager(layoutManager);

        RecipeAdapter recipeAdapter = new RecipeAdapter(MainActivity.this,recipes);
        recyclerView.setAdapter(recipeAdapter);
    }
}